In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [4]:
dframe

         date variable     value
0  2000-01-03        A -0.497119
1  2000-01-04        A -0.937970
2  2000-01-05        A -0.032859
3  2000-01-03        B -0.190739
4  2000-01-04        B  0.591574
5  2000-01-05        B -1.399708
6  2000-01-03        C -1.265246
7  2000-01-04        C  0.311252
8  2000-01-05        C  1.590995
9  2000-01-03        D -1.096617
10 2000-01-04        D  0.661915
11 2000-01-05        D  1.316580

In [7]:
dframe_piv = dframe.pivot('value','date','variable')
dframe_piv

date      2000-01-03 2000-01-04 2000-01-05
value
-1.399708       None       None          B
-1.265246          C       None       None
-1.096617          D       None       None
-0.937970       None          A       None
-0.497119          A       None       None
-0.190739          B       None       None
-0.032859       None       None          A
 0.311252       None          C       None
 0.591574       None          B       None
 0.661915       None          D       None
 1.316580       None       None          D
 1.590995       None       None          C

In [10]:
df= DataFrame({'key':list('AABBB'),'key2':list('22233')})
df

  key key2
0   A    2
1   A    2
2   B    2
3   B    3
4   B    3

In [15]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [17]:
df.drop_duplicates()

  key key2
0   A    2
2   B    2
3   B    3

In [18]:
df.drop_duplicates('key')

  key key2
0   A    2
2   B    2

In [19]:
dframe

         date variable     value
0  2000-01-03        A -0.497119
1  2000-01-04        A -0.937970
2  2000-01-05        A -0.032859
3  2000-01-03        B -0.190739
4  2000-01-04        B  0.591574
5  2000-01-05        B -1.399708
6  2000-01-03        C -1.265246
7  2000-01-04        C  0.311252
8  2000-01-05        C  1.590995
9  2000-01-03        D -1.096617
10 2000-01-04        D  0.661915
11 2000-01-05        D  1.316580

In [20]:
df

  key key2
0   A    2
1   A    2
2   B    2
3   B    3
4   B    3

In [21]:
df.drop_duplicates(['key'],take_last=True)

TypeError: drop_duplicates() got an unexpected keyword argument 'take_last'

In [26]:
d= DataFrame({'key':list('AAB'),'key2':list('243')})
d

  key key2
0   A    2
1   A    4
2   B    3

In [33]:
 s= {'2':'okay','47':'karlo','3':'sex'}

In [34]:
s

{'2': 'okay', '3': 'sex', '47': 'karlo'}

In [35]:
d['deksale']=d['key2'].map(s)

In [36]:
d

  key key2 deksale
0   A    2    okay
1   A    4     NaN
2   B    3     sex

In [38]:
##MApping Done

In [39]:
##Replace